/*!------------------------------------------------
@file       FugaList.h
@brief      
@attention  なし
--------------------------------------------------*/

#ifndef FUGALIST_H_
#define FUGALIST_H_

// インクルードファイル ================================

// クラスの前方宣言 ====================================

// マクロの宣言 ========================================

// 型の宣言 ============================================

// クラス定義 ==========================================
/*!--------------------------------------------------
@class       FugaList.h
@brief      
@note       
@attention  なし
@see        なし
--------------------------------------------------*/
class FugaList {
 public:
  //! Constructor
  FugaList();
  //! Destructor
  virtual ~FugaList();

 protected:
 private:
};

#endif  // FUGALIST_H_
