/*!------------------------------------------------
@file       HogeList.h
@brief      
@attention  なし
--------------------------------------------------*/

#ifndef HOGELIST_H_
#define HOGELIST_H_

// インクルードファイル ================================

// クラスの前方宣言 ====================================

// マクロの宣言 ========================================

// 型の宣言 ============================================

// クラス定義 ==========================================
/*!--------------------------------------------------
@class       HogeList.h
@brief      
@note       
@attention  なし
@see        なし
--------------------------------------------------*/
class HogeList {
 public:
  //! Constructor
  HogeList();
  //! Destructor
  virtual ~HogeList();

 protected:
 private:
};

#endif  // HOGELIST_H_
